Revit 2024 API
UIApplication.Application Property
 Returns the database level Application represented by this UI level Application.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public Application Application { get; }
Visual Basic
Public ReadOnly Property Application As Application
	Get
Visual C++
public:
property Application^ Application {
	Application^ get ();
}
See Also
UIApplication Class
Autodesk.Revit.UI Namespace